{"text":"BMW Unveils World's Fastest Hydrogen-Powered Car  PARIS (Reuters) - German luxury carmaker BMW unveiled the  world's fastest hydrogen-powered car at the Paris auto show on  Wednesday, dubbed the H2R, capable of exceeding 300 kilometers  (185 miles) per hour.","label":3}
{"text":"Video Shows Militants Killing Italian-Iraqi, Turk  BAGHDAD (Reuters) - Islamic militants on Monday distributed  a video in Iraq showing the killings of two men who identified  themselves as an Italian of Iraqi origin and a Turk.","label":0}
{"text":"Judge Is Set to Decide Oracle-PeopleSoft Battle The judge who will decide whether to block defenses by PeopleSoft against Oracle #39;s \\$7.7 billion hostile tender offer, ended the two-week trial Friday by urging ","label":2}
{"text":"Apple ships security patch for iChat Apple Computer last week released a security patch for its Mac OS X iChat instant messaging client, which contains a flaw that hackers could use to takeover a person #39;s computer.","label":3}
{"text":"Minister in Pyongyang to demand explanation on blast (AFP) AFP - A government minister, now in Pyongyang, said he will seek an explanation from his North Korean hosts of a reported blast in the north of the country three days ago.","label":0}
{"text":"Open Office XML May Satisfy ISO Microsoft #39;s (Quote, Chart) dominance on the desktop may turn out to be Sun Microsystems #39; (Quote, Chart) gain in the end. A letter to Sun Microsystems #39; COO Jonathan Schwartz by the European Commission (EC) this ","label":3}
{"text":"AMERICAN MOSAIC And a report about why the next place for travelers could be out of this world. How would you like to take a rocket ship into space?","label":3}
{"text":"UN remembers Iraq staff, a year after bombing GENEVA: Tears flowed as the United Nations marked the first anniversary yesterday of the bombing that shattered its Baghdad headquarters. ","label":0}
{"text":"Arrest made in Cisco source code theft ITWorld: Police in the UK have arrested a man in connection with the theft of source code from networking equipment maker Cisco Systems Inc.","label":3}
{"text":"Before-the-Bell: Nortel, Ciena Gain  NEW YORK (Reuters) - Shares of Nortel Networks Corp. &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=NT.N target=\/stocks\/quickinfo\/fullquote\"&gt;NT.N&lt;\/A&gt;  rose 3.7 percent before the bell on Thursday after the telecoms  equipment maker put a specific date, Jan. 10, on when it will  start filing its much-delayed restatement of financial results.","label":2}
{"text":"Six militants killed in clash with Pakistan troops near Afghan &lt;b&gt;...&lt;\/b&gt; Pakistani troops have killed six suspected al-Qaeda militants in a clash in the rugged South Waziristan region bordering Afghanistan.","label":0}
{"text":"\\$1bn to build unmanned fighter A US company has received more than \\$1bn in funding to build prototype unmanned fighter aircraft for the American military.","label":3}
{"text":"Palestinian minister to visit jailed Fatah leader mooting &lt;b&gt;...&lt;\/b&gt; RAMALLAH, West Bank - Palestinian minister without portfolio Kadura Fares said he will visit Marwan Barghuti on Friday to discuss the imprisoned Fatah leaders plan to run for the presidency in January.","label":0}
{"text":"Broussard gives LSU leg up BATON ROUGE, La. -- Alley Broussard ran for 80 yards and a touchdown, spearheading a strong game by No. 19 Louisiana State in a 24-7 victory over Vanderbilt last night.","label":1}
{"text":"Alien Moon Titan Flyby Coverage Begins Tuesday on Local Cable &lt;b&gt;...&lt;\/b&gt; It is an encounter that planetary scientists and space science enthusiasts have been waiting for as the Cassini-Huygens Probe darts into the upper atmosphere of the Saturn moon Titan on Tuesday afternoon October 26th.","label":3}
{"text":"Ringing in the season The sounds of tinkling bells could be heard above the bustle of the Farmers Market on the Long Beach Promenade, leading shoppers to a row of bright red tin kettles dotting a pathway Friday.","label":2}
{"text":"Virus protection for cell phones on the way Anti-virus protection will ship later this month with some new phones in Japan, a harbinger of cellular threats to come. Security products are already available for handheld ","label":3}
{"text":"Ex-Shell chief Watts demands public tribunal to clear his name The former chairman of Shell, Sir Philip Watts, is to take the main City regulator, the Financial Services Authority, to a public tribunal to try to clear his name over the oil giant #39;s reserves scandal.","label":2}
{"text":"Iran Will Likely Freeze Nuke Enrichment-Official A senior Iranian official said on Thursday he was optimistic Iran would halt its uranium enrichment program as Europe demands, in a move aimed ","label":0}
{"text":"Hyundai scores well in value survey NEW YORK (CNN\/Money) - Cars made by Korea #39;s Hyundai have been rated as the best value among all makes due to improved customer opinion of its quality, according to a published report Monday.","label":2}
{"text":"Nigeria Militia Leader Says Deal Reached ABUJA, Nigeria Sept. 29, 2004 - The leader of militia fighters threatening to widen a battle for control of Nigeria #39;s oil-rich south said Wednesday he agreed to a tentative deal with President Olusegun Obasanjo ","label":0}
{"text":"Caller ID: Do you really know who #39;s calling? This week, a company is launching technology that will make it possible for someone to choose what appears on phones that have Caller ID, the feature for displaying identifying information about an incoming call.","label":3}
{"text":"Yankees beat Twins 6-to-5 The New York Yankees beat the Twins 6-to-5 Saturday to advance to the AL Championship. They will play the Boston Red Sox. Ruben Sierra hit a three-run homer in the eighth inning.","label":1}
{"text":"Australia off to patient start in Bangalore Australia has made a slow but solid start to the first cricket Test against India in Bangalore. After seven overs, the tourists had reached 0 for 14, with Matthew Hayden on 5 and Justin Langer on 4. For up to date scores, visit our live scorecard.","label":1}
{"text":"Intel to debut new Itaniums Nov. 8 com October 29, 2004, 12:02 PM PT. ZDNet #39;s survey of IT professionals in October kept upgrading hardware at number two on the businesses radar throughout the year.","label":3}
{"text":"Toll Rings Homebuilders #39; Bell Homebuilders strode upstairs Tuesday after Toll Brothers (TOL:NYSE - news - research) reported record fourth-quarter sales, citing strong demand from affluent buyers.","label":2}
{"text":"S.Africa Seizes Uranium Enrichment Materials  JOHANNESBURG (Reuters) - South Africa seized 11 shipping  containers of uranium enrichment materials in a raid on a firm  run by a man it has charged under laws forbidding nuclear  proliferation, a government agency said Tuesday.","label":0}
{"text":"HK legislative poll points to the future When the British ruled Hong Kong, as pro-Beijing politicians are fond of pointing out, the territory #39;s people had no direct influence over the way they were governed.","label":0}
{"text":"Germany arrests suspected Al-Qaida financier German authorities have arrested a businessman wanted by Spain on charges he helped fund the Al-Qaida terrorist network for years.","label":0}
{"text":"Japan risks damaging China relations with Lee visa The decision, which prompted an immediate protest from Beijing, was the latest sign that Japan is hardening its diplomatic stance towards China.","label":0}
{"text":"Sanz, Rita Big Winners at Latin Grammys LOS ANGELES - It seemed like a rerun of the 2002 Latin Grammys. Once again, Spanish heartthrob singer Alejandro Sanz dominated the show - only this time, Sanz didn't show up to collect his trophies...","label":0}
{"text":"Ch. League: Milan, Barca, power through AC Milan and Barcelona joined the other powerhouses in the second round of the Champions League on Wednesday while Arsenal had two players sent off in a fourth tie in a row and still isn #39;t there yet.","label":1}
{"text":"Russia Seeks Aid for Space Program By VLADIMIR ISACHENKOV     MOSCOW (AP) -- Russia's space program is recovering from its post-Soviet financial meltdown, but government spending is still just a fraction of what is needed to revive the program to its former glory, top Russian space experts said Monday.    Some critics have assailed the Kremlin for allowing Russia to lose its edge in space exploration - an edge exemplified by the launch exactly 47 years ago of Sputnik, the world's first satellite...","label":3}
{"text":"Hurricane losses may reach \\$10bn Hurricane Frances could cause between \\$2bn and \\$10bn in insured losses in the US, experts predict as the storm pummels Florida.","label":2}
{"text":"Partial solar eclipse is a real time-twister A partial solar eclipse will take place next week, oddly ending the day before it begins. The eclipse will be visible, weather permitting, from northeastern portions of Asia, including all of Japan ","label":3}
{"text":"Northwestern Medical cites performance boost from Concord software Concord management software has helped uncover a range of problems at Northwestern medical group, which is now seeing improved system performance.","label":3}
{"text":"Schlumberger Posts Profit But Shares Fall  HOUSTON (Reuters) - Schlumberger Ltd. &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=SLB.N target=\/stocks\/quickinfo\/fullquote\"&gt;SLB.N&lt;\/A&gt;, the world's  largest oilfield services company, on Friday posted a  third-quarter profit but weakness in the U.S. Gulf of Mexico  and a pullback in its Russian operations weighed on shares.","label":2}
{"text":"DNA tests identify embassy suicide bomber Indonesian police said yesterday that DNA tests had identified a suicide bomber involved in a deadly attack this month on the Australian embassy in Jakarta.","label":0}
{"text":"Harry in nightclub scuffle Prince Harry has been hit in the face with a camera and cut a photographer #39;s lip as he pushed it away outside a nightclub in London #39;s West End.","label":0}
{"text":"Wal-Mart Sees Nov. U.S. Sales Up 0.7 Pct (Reuters) Reuters - Wal-Mart Stores Inc. , the\\world's largest retailer, said on Saturday it expects a 0.7\\percent increase in November sales at its U.S. stores open at\\least one year, down from a forecast of 2 percent to 4 percent\\a week ago.","label":2}
{"text":"American Deserters Find a Mixed Reception in Canada Despite Canada's opposition to the Iraq war, the government also is opposing the U.S. deserters' refugee applications, saying the soldiers are not persecuted. It is resisting the argument that the Iraq war is illegal.","label":0}
{"text":"Celtics Still Waiting to Hear From Payton (AP) AP - Ten days after trading for Gary Payton, the Boston Celtics still have no idea if the nine-time All-Star will ever wear a Celtics' uniform.","label":1}
{"text":"First Look: \\$100 Video Editing Apps Square Off New entry-level programs from Adobe and Pinnacle bring plenty of editing power to desktop directors.","label":3}
{"text":"Ask Jeeves to Launch Desktop Search On the heels of a series of desktop search releases, Ask Jeeves Inc. is set to launch an application to scour users #39; hard drives for e-mails and files.","label":3}
{"text":"Not Everybody Loves Raymond When Raymond Gilmartin became chairman of the drug maker Merck, it was close to introducing several new medicines. Now, the company is in crisis.","label":2}
{"text":"Family of US defector to North Korea eagerly awaits reunion (AFP) AFP - The family of US soldier Charles Robert Jenkins cheered his release from US military custody in Japan and said they look forward to seeing him for the first time since he defected to North Korea in 1965.","label":0}
{"text":"Geiberger Holds On For First Victory Since 1999 GREENSBORO, NC -- Golfer Brent Geiberger today cruised to a two-shot victory in the Chrysler Classic of Greensboro, five years after his only victory on the PGA Tour.","label":1}
{"text":"US relayers want to keep Sydney golds CBC SPORTS ONLINE - The US Olympic Committee doesn #39;t think the entire American team that won gold in the 4x100-metre relay at the 2000 Sydney Olympics should be stripped of their medals.","label":1}
{"text":"Vodafone doubles dividend Vodafone, the world #39;s largest mobile phone company, today gave shareholders an early Christmas present by doubling its half-year dividend to 1.91p and extending a share buy-back programme.","label":2}
{"text":"Darfur witnesses arrested in Sudan The Sudanese government was accused yesterday of arresting people who have spoken to foreign visitors, ceasefire monitors and journalists about continuing atrocities in Darfur.","label":0}
{"text":"Coming soon: full-scale DVD format war TOKYO - A full-scale war over DVD formats is only a matter of time - the electronics industry can smell it in the air. As the two opposing camps continue to recruit allies, negotiations are no longer about averting a confrontation.","label":3}
{"text":"Google to Help Microsoft Promote Windows (PC World) PC World - The search engine's toolbar is included in new Windows XP \"Partner Pack.\"","label":3}
{"text":"Knock, knock: Ichrio nearing hit record after win OAKLAND, Calif. - All that stands today between Ichiro and an unobstructed look at George Sisler is an unidentified Tim Hudson body part.","label":1}
{"text":"A New \\$3Bln Tax Claim Looms Over Yukos Reports of a new tax claim dealt a blow to Yukos on Monday, as the embattled oil major announced it would cut this year #39;s oil output forecast and defer certain tax payments because of a lack of cash.","label":2}
{"text":"Mild Seven Renault F1 Team Preview, Chinese Grand Prix The Mild Seven Renault F1 Team preview of the Chinese Grand Prix.","label":1}
{"text":"MOFA says cross-strait issue misinterpreted Minister of Foreign Affairs Mark Chen () yesterday blamed the uneven levels of democratization in Singapore and Taiwan for Prime Minister Lee Hsien Loong #39;s () refusal on Sunday to support Taiwan if it provoked cross-strait conflict over ","label":0}
{"text":"Major bank #39;s layoffs felt in Hudson Valley Bank of America began cutting jobs Wednesday but officials would not confirm how many or where. But a spokeswoman said cuts were occurring, and would eventually reach 12,500, the same number given in spring when the merger became final. ","label":2}
{"text":"WORLD BRIEFS US SOLDIER KILLED IN AFGHANISTAN. An attack on a patrol killed an American soldier in Afghanistan, the third US fatality there this week, the military said yesterday, amid a flurry of attacks that wounded ","label":0}
{"text":"India offers unqualified talks on Kashmir SRINAGAR, India -- India's prime minister offered yesterday to hold unconditional talks on Kashmir ''with anyone and everyone quot; as his country began withdrawing troops from the divided Himalayan region as a goodwill gesture to rival Pakistan.","label":0}
{"text":"Dlr Regains Poise After ZEW Slump  LONDON (Reuters) - News German investor confidence had  plunged to its lowest level in almost 2 years gave the dollar  much needed support on Tuesday and European shares eased from  6-month highs after a mixed bag of earnings results.","label":2}
{"text":"Sun Micro Posts Narrower Quarterly Loss Network computer maker Sun Microsystems Inc. (SUNW.O: Quote, Profile, Research) on Thursday posted a narrower quarterly loss as revenue rose year over year for the ","label":2}
{"text":"Furcal gets concurrent sentence on second impaired driving charge Atlanta Braves shortstop Rafael Furcal, who is serving a 21-day jail sentence for being arrested while on probation, pleaded guilty Thursday to his second drunk driving charge.","label":1}
{"text":"'Resident Evil' Sequel Tops Box Office LOS ANGELES - The undead came alive once more over the weekend as \"Resident Evil: Apocalypse\" debuted at No. 1 at the box office, bringing in \\$23.7 million...","label":0}
{"text":"Mark Martin to To Retire After 2005 Season CONCORD, NC (Oct. 14, 2004) - Roush Racings Mark Martin announced today that next season will be his last racing for the NEXTEL Cup.","label":1}
{"text":"Gas Prices Drop As Crude Oil Supply Rises An increase in the worldwide supply of crude oil contributed to a dip in U.S. prices at the gas pump over the last two weeks, an industry analyst said Sunday.","label":2}
{"text":"Sirius Names Karmazin CEO, Shares Jump (Reuters) Reuters - Sirius Satellite Radio Inc.\\ on Thursday named former Viacom Inc. President Mel\\Karmazin as its chief executive, in the latest migration of a\\mainstream radio heavyweight to the fledgling satellite\\industry.","label":2}
{"text":"Banks, insurers lead Nikkei higher Japanese stocks rose on Tuesday on expectations that a Government report later today would provide further evidence of strength in the world #39;s second-largest economy.","label":2}
{"text":"Fierce Battles for Control of Holy City Explosions and gunfire shook Najaf today amid fierce battles between US forces and Shiite militants, who remained in control of a revered shrine there as negotiations dragged on for its handover to religious authorities.","label":0}
{"text":"Pippen will call it quits today As the Sun-Times first reported, Scottie Pippen will end two years of speculation, false alarms and his own indecision about finishing his spectacular career this morning when he announces his retirement after the Bulls #39; practice at the Berto Center.","label":1}
{"text":"Kumble raises Indian hopes of win MADRAS, India -- Indian leg-spinner Anil Kumble achieved his sixth 10-wicket haul in tests to raise his side #39;s hopes of a series-equaling win in the second test against Australia in Madras.","label":1}
{"text":"Red Hat buys Netscape Enterprise Solutions from AOL Enterprise Linux specialist Red Hat has snapped up choice pieces of Netscape Enterprise solutions from AOL. These include the Netscape Enterprise Suite and include Netscape Directory Server and Netscape Certificate Management System.","label":3}
{"text":"Back-To-School Shopping Now Includes Electronics For back-to-school shoppers, a new alphabet reigns, and it starts with E for electronics. With camera cell phones and the Apple iPod music player topping student wish lists, some of the hottest gadgets have little to do with pen or paper, much less studying.","label":3}
{"text":"Gemstar-TV Guide Taps Fox Executive as CEO Gemstar-TV Guide International Inc. said on Friday it replaced Chief Executive Jeff Shell, credited with steering the company through a patch of legal woes, with a Fox ","label":2}
{"text":"Same old song LANDOVER, Md. -- The past took center stage Monday night at Fed-Ex Field, and the feel of history was almost palpable. But when push came to shove, it wasn #39;t really the kind of history that the Washington ","label":1}
{"text":"Abductions in Iraq a big business Groups tied to Abu Musab Zarqawi claim a major car bombing Tuesday, taking Westerners as hostages.","label":0}
{"text":"U.S. Treasuries Drift Lower (Reuters) Reuters - U.S. Treasury prices drifted lower on\\Wednesday but trade was subdued as the market pondered the\\scale of interest rate hikes a day after the Federal Reserve\\delivered its third straight rate increase.","label":2}
{"text":"Comcast Plans Music Video-Web Offering (AP) AP - Comcast Corp. plans to begin offering music videos on demand to its broadband Internet subscribers early next year, part of a multiyear deal with the television network Music Choice.","label":3}
{"text":"Wireless NewsFactor PalmOne Debuts New Tungsten with 256-MB Flash &lt;b&gt;...&lt;\/b&gt; The 256 MB memory allocates 215 MB as storage for the user, with 55 MB as program memory and 160 MB as the internal flash drive. The flash memory in the Tungsten T5 is still large enough to ","label":3}
{"text":"Uzbek court jails 23 over attacks A court in Uzbekistan sentences 23 people to up to 18 years in jail for their role in a series of atttacks.","label":0}
{"text":"Cingular-AT amp;T Wireless Deal Gets Justice Dept. OK WASHINGTON -- Antitrust regulators at the Justice Department have given their blessing to the acquisition by Cingular Wireless of AT amp;T Wireless Services.","label":2}
{"text":"California Regulator Is Suing Four Insurers and a Broker It Says Received Kickbacks The California insurance commissioner said on Wednesday night that the broker had agreed to cooperate in developing a case against the insurers.","label":2}
{"text":"Gas Prices Drop As Crude Oil Supply Rises CAMARILLO, Calif. Nov 7, 2004 - An increase in the worldwide supply of crude oil contributed to a dip in US prices at the gas pump over the last two weeks, an industry analyst said Sunday.","label":2}
{"text":"Este Lauder Officer Joins Disney Board The Walt Disney Company said on Wednesday that Fred H. Langhammer, an executive for the Este Lauder Companies, was named to its board as an independent director and ","label":2}
{"text":"Chain Store Sales Rise in the Oct 9 Week  NEW YORK (Reuters) - U.S. chain store sales fell in the  first week of October as increased customer traffic in malls  failed to translate into bigger purchases, a report said on  Tuesday.","label":2}
{"text":"Manmohan Singh greets Than Shwe at Rashtrapati Bhavan on Monday. &lt;b&gt;...&lt;\/b&gt; New Delhi, Oct. 25: Visiting Myanmar military ruler Senior General Than Shwe today told his hosts his country will not allow its soil to be used by Northeast insurgents against Indian interests.","label":0}
{"text":"Exec Says Oracle Lowering PeopleSoft Bid Oracle Corp.'s hostile \\$7.7 billion bid for rival software maker PeopleSoft Inc. could drop by one-third to one-fourth, Oracle co-president Safra Catz said Monday.","label":3}
{"text":"NAPSTER FOUNDER REVEALS NEW FILE-SHARING PROJECT NAPSTER creator SHAWN FANNING has revealed his plans for a new licensed file-sharing service with an almost unlimited selection of tracks.","label":3}
{"text":"Gun battle breaks out near Green Zone BAGHDAD -- A heavy gunfight broke out yesterday on a dangerous street in central Baghdad within blocks of the country's most fortified facilities, including the US Embassy and interim Iraqi government headquarters. Five more American troops were killed in the volatile Anbar province.","label":0}
{"text":"Sony brings new technology to TV line Sony said Thursday that it would begin selling eight new television models outfitted with semiconductors designed to produce sharper images, including two with a lighting system that the company says is the world #39;s first. ","label":3}
{"text":"S.Korea FM: No Optimism on Nuclear Talks with North  SEOUL (Reuters) - South Korea is working with its  diplomatic partners to try to hold nuclear talks with North  Korea this month, but recent North Korean comments suggested no  grounds for optimism, the South's foreign minister said on  Friday. There are plans to hold a fourth round of nuclear  negotiations among the two Koreas, the United States, China,  Japan and Russia by the end of September as the countries  agreed at the previous session in June.","label":0}
{"text":"US Call Centers To Continue Migration Overseas - Report NEW YORK (Dow Jones)--Call centers and agent positions in the US, a hot-button sector in the jobs outsourcing debate, will continue to migrate in the next few years ","label":3}
{"text":"Reason to beware The death and destruction inflicted by Hurricane Ivan confirms that Southwest Floridians #39; fears of the powerful hurricane were well justified.","label":2}
{"text":"Search half-finished at Saskatchewan reserve, still no clues to Tamra's fate (Canadian Press) Canadian Press - BALGONIE, Sask. (CP) - Police combing a Saskatchewan reserve  said Wednesday they've covered about half of the search area without finding any clues to the fate of a young Regina girl missing for two months.","label":0}
{"text":"Telstra to split network TELSTRA will make a dramatic corporate restructure in a bid to appease the competition watchdog and win over wary Nationals as the telco readies for its \\$30 billion full privatisation.","label":2}
{"text":"Ouija Board surges to Filly and Mare Turf win English and Irish classic winner Ouija Board (GB) more than justified the hype surrounding her presence in the \\$1-million Breeders Cup Filly and Mare Turf (G1), surging past Grade 1 winner Film Maker in the lane to capture the 1 3\/8-mile contest at ","label":1}
{"text":"Before-the-Bell: SuperGen Shares Soar  NEW YORK (Reuters) - Shares of SuperGen Inc. &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=SUPG.O target=\/stocks\/quickinfo\/fullquote\"&gt;SUPG.O&lt;\/A&gt;  jumped more than 24 percent in trading before the market opened  on Wednesday after MGI Pharma Inc. &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=MOGN.O target=\/stocks\/quickinfo\/fullquote\"&gt;MOGN.O&lt;\/A&gt; said it would take  a \\$40 million stake in the company as part of a cancer drug  license deal.","label":2}
{"text":"UCF signs Speraw to 3-year deal and seven months after his leading UCF to its third NCAA Tournament -- men #39;s basketball Coach Kirk Speraw signed an incentive-laden contract ","label":1}
{"text":"Germany expels Jordanian allegedly linked to Zarqawi group (AFP) AFP - Germany has expelled a Jordanian suspected of links to a terrorist group run by Abu Musab al-Zarqawi, who is wanted for launching several attacks in Iraq, the Bavarian state interior ministry said.","label":0}
{"text":"Italy beats US Eagles Italy fought off a strong second-half comeback by the United States and won its rugby union Test 43-25 on Saturday. Flyhalf Luciano Orquera scored 20 points including a try, and winger ","label":1}
{"text":"Schilling Ankle Exam Postponed (AP) AP - An examination of Boston Red Sox pitcher Curt Schilling's right ankle scheduled for Friday was postponed due to a scheduling conflict.","label":1}
{"text":"Unemployment Claims Jump by 20,000 The number of Americans filing new claims for unemployment benefits rose last week by 20,000, the largest jump in a month, the Labor Department reported Thursday.","label":2}
{"text":"China and Linux: Microsoft, Beware! While open-source software is new to the Middle Kingdom, Beijing is looking to change that. Red Hat CEO Matthew Szulik explains why.","label":3}
{"text":"Floridians would get Tax Relief Under Bill Passed by US Senate Floridians will be able to deduct state sales tax payments from their federal income tax returns for the next two years, under one part of a wide-ranging bill the US Senate passed today.","label":2}
{"text":"DUNHILL LINKS CHAMPS LATEST BETTING ODDS NEWS David Howell further justified his selection by readaBet on the second day of the Dunhill Links Championship and now holds a one-stroke lead after posting a 65 at St.","label":1}
{"text":"Philippines link to JI training A SECRET government report says Muslim guerillas in the southern Philippines have hosted terror training camps for militants from Indonesia and Malaysia for at least seven years.","label":0}
{"text":"No. 10 Michigan State Routs Nicholls St. (AP) AP - Led by Maurice Ager's 19 points, No. 10 Michigan State scored more than 100 points for the third straight game in a 102-52 win over Nicholls State on Saturday.","label":1}
{"text":"Update 1: Orbitz Profit Soars on Revenue Surge Orbitz Inc., the Internet travel agency that is being bought by Cendant Corp., Wednesday posted a 30 percent jump in third-quarter profit, aided by a surge in hotel business.","label":2}
{"text":"Anaheim Angels Team Report - September 20 (Sports Network) - The Anaheim Angels will try to get back on the winning track and break an 18-inning scoreless drought when they open up a crucial three-game set against the Seattle Mariners tonight at Angel Stadium.","label":1}
{"text":"Magazine's award to Klitschko rings hollow Vitali Klitschko stood at a podium in Las Vegas Friday holding a clone of the belt that Jack Dempsey once wore. It was one of the Ring magazine belts that the publication awards to its recognized champions.","label":1}
{"text":"Kraft Foods shedding units? Reports say No. 1 food company may divest Oscar Mayer, Post cereal lines and candy units. NEW YORK (CNN\/Money) - Kraft Foods may put its well-known Oscar Mayer, Post cereal and Altoids brands up for sale as the No.","label":2}
{"text":"Rejecting the Next Bill Gates As Condoleezza Rice enters the State Department, she will face a number of pressing foreign policy problems that she cannot solve. This will not be for lack of effort or intelligence on her part. It's just that many foreign policy crises involve the interests and activities of countries across the globe, and changing them takes time. And even then, whether it's Iran, North Korea or Darfur, there is no quick fix that Washington can impose. But there is a growing danger for the United States that needs urgent attention, that can be solved and that is almost entirely within Rice's power to handle. It's the foreign visa crisis. Left unattended, it is going to have deep and lasting effects on American security and competitiveness.","label":3}
{"text":"Gonzales given triple-life sentence A Sydney student will spend the rest of his life in jail for the stabbing murders of his parents and sister in 2001. Sef Gonzales showed no emotion when Justice Bruce James told him in the Supreme Court in ","label":0}
{"text":"Palestinian poll race tight Two of the first opinion polls since nominations closed for the Palestinian presidential election show a tight race between the establishment candidate, Mahmoud Abbas, and the imprisoned military commander, Marwan Barghouti.","label":0}
{"text":"Fulham call in lawyers over brawl Fulham have brought in lawyers for advice on the best way to fight a mass of Football Association disciplinary charges which could also land manager Chris Coleman and several of his players with major suspensions and fines.","label":1}
{"text":"ITAA: IT job growth to slow for rest of 2004 SEPTEMBER 08, 2004 (COMPUTERWORLD) - Although there was a slight 2 increase in IT employment early in the year, IT job growth is expect to slow for the remainder of 2004, according to a report released today by the Arlington, Va.","label":3}
{"text":"Anarchists Emerge as the Convention's Wild Card New York police consider self-described anarchists the unknown factor in whether the Republican convention demonstrations remain under control.","label":0}
{"text":"IDC Forum: Is IT creativity dead? Pouring fuel on the debate over whether IT provides a competitive advantage to corporations, a pair of prominent industry observers Monday offered starkly different views of the role computer technology can play in transforming business strategy.","label":3}
{"text":"Aluminum Beer Bottles May Render Koozies Obsolete PITTSBURGH -- A Pennsylvania brewery is betting beer drinkers are willing to pay an extra dollar to keep their drinks cold nearly an hour longer.","label":2}
{"text":"Decision appealing for Kapler and Nixon Beware, titans of the legal world. There may be a new force in town.  quot;I'm going to hire the law firm of Kapler and Nixon, quot; Red Sox general manager Theo Epstein said after outfielders Gabe Kapler and Trot Nixon yesterday won the appeals of their three-game suspensions and \\$1,000 fines for their roles in the July 24 bench-clearing incident with ...","label":1}
{"text":"A Mall for America's Geeks A road trip detour to the Mall of America offers a look at some remarkable feats of modern engineering. Marvels range from genetically modified glowing fish to roller coasters that no sane human should ride after lunch. Michelle Delio reports from Bloomington, Minnesota.","label":3}
{"text":"Humana Leads Insurance Sector Higher Shares of major Medicare providers moved higher Monday after Humana Inc. handed Wall Street strong third-quarter earnings results, echoing rather upbeat investor sentiment seen throughout the sector.","label":2}
{"text":"IU Researchers Helping to Study Video Game Violence Link (Indianapolis) - Indiana University researchers are trying to find out if playing violent video games can make people more prone to violence.","label":3}
{"text":"US blue chips hurt by Alcoa, but techs rise US blue chips were knocked lower on Friday by a profit warning from aluminum maker Alcoa Inc. , but tech stocks gained after a judge rejected a government bid to block a takeover of PeopleSoft Inc.","label":2}
{"text":"Pep Boys Stock Down After Earnings Miss  CHICAGO (Reuters) - Shares of auto parts retailer Pep  Boys-Manny, Moe   Jack &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=PBY.N target=\/stocks\/quickinfo\/fullquote\"&gt;PBY.N&lt;\/A&gt; fell 10 percent on Thursday, a  day after it said earnings dropped 48 percent last quarter on  more struggles in its service operations, missing estimates.","label":2}
{"text":"Online bidding firms seek bounce from insurance industry scandal Customers in search of a cheap airfare, antiques or a stock trade can scan the Web for good deals. But when it comes time for companies to buy group insurance policies, they #39;ve largely ","label":2}
{"text":"Bratz topples Barbie in Battle of the Dolls At the ripe old age of 45, Barbie has been knocked off her perch in Britain by streetwise upstart Bratz in the Christmas battle of the dolls.","label":2}
{"text":"Cassini unveils mysterious Saturn moon Titan NASA scientists are poring over the latest pictures unveiling Saturn #39;s mysterious moon Titan. The images show distinct dark and bright surface areas.","label":3}
{"text":"1  1 = Value at Blackboard Blackboard is turning in good growth and rising margins with two hot education software products.","label":2}
{"text":"Kezman vows to hit the goal trail Mateja Kezman believes he can go on a goalscoring spree after finally opening his account for Chelsea. The former PSV Eindhoven striker scored the matchwinner in the 57th minute to give Chelsea victory over ","label":1}
{"text":"Angels Crush Royals 21-6 (AP) AP - Jeff DaVanon became the first Angels player in 13 years to hit for the cycle and drove in four runs, leading Anaheim to a 21-6 victory Wednesday night that completed a seven-game season sweep of the Kansas City Royals.","label":1}
{"text":"Molina ties career high with four hits BRONX, New York (Ticker) -- Kelvim Escobar was the latest Anaheim Angels #39; pitcher to subdue the New York Yankees. Escobar pitched seven strong innings and Bengie Molina tied a career-high with four hits, including ","label":1}
{"text":"As countdown goes on, so does the killing SO, JUST the nine days to go. Nine days for the Sudanese government to clean up its act, disarm the Janjaweed militia and make Darfur safe for the 1.2 million people driven from their homes by the campaign ","label":0}
{"text":"Adelaide gives Murdoch another victory: Delaware Shareholders in The News Corporation Ltd (publisher of The Australian) voted overwhelmingly to endorse the final act in five decades of expansion: to shift the company #39;s domicile from the South Australian capital to the US state of Delaware.","label":2}
{"text":"OPEC and Ivan Bring Pressure on Oil Prices Opec members have split on whether their output should be increased in a bid to boost global supply that might cause oil prices to drop.","label":2}
{"text":"Iran adds to international concerns with missile, nuclear moves TEHRAN : Iran gave cause for fresh international alarm as a top regime official announced the Islamic republic had boosted the range of its ballistic missiles and hardline MPs backed a move to defy the UN #39;s nuclear watchdog.","label":0}
{"text":"WWW KOTV.com _ Two of three UN workers kidnapped in Afghanistan have called home to say they are OK, officials and relatives said Tuesday, and one hostage said she expected to be released soon.","label":0}
{"text":"Amazons A9 Web search makes debut SAN FRANCISCO - Amazon.com Inc. unveiled the new version of its Web search service on Wednesday in a move that could portend a long-anticipated clash between online retailers and search providers like Google Inc.","label":3}
{"text":"Chiron to delay flu vaccine shipments Emeryville #39;s Chiron Corp. said Thursday that it will delay shipments until early October of its flu vaccine, Fluvirin, after the company identified a small number of lots that do not meet product sterility specifications.","label":2}
{"text":"JPEG exploit could beat antivirus software Security experts say that attacks using image files could bypass established defenses.","label":3}
{"text":"Microsoft Threatens Patent Lawsuits \\\\More FUD  from our friends in Seattle:\\\\\"Asian governments using Linux will be sued for IP violations, Microsoft CEO\\Steve Ballmer said today in Singapore. He did not specify that Microsoft would\\be the company doing the suing, but it's difficult to read the claim as anything\\other than a declaration of IP war.\"\\\\\"According to a Reuters report (which we fervently hope will produce one of\\Ballmer's fascinating 'I was misquoted' rebuttals*), Ballmer told Microsoft's\\Asian Government Leaders Forum that Linux violates more than 228 patents. Come\\on Steve, don't hold back - what you mean 'more than 228' - 229? 230? Don't pull\\your punches to soften the blow to the community. \"Some day,\" he contin ...\\\\","label":3}
{"text":"Sweet Catomine takes BC Juvenile Fillies Sweet Catomine overcame traffic problems on the turn for home and posted a 3-length victory in the \\$1 million Breeders #39; Cup Juvenile Fillies on Saturday.","label":1}
{"text":"US Court Rejects Movie, Music Makers' Piracy Claims (Reuters) Reuters - A federal appeals court on Thursday\\delivered a stinging blow to the anti-piracy efforts of major\\movie studios and music companies, ruling that several online\\file-sharing software companies are not liable for copyright\\infringement.","label":3}
{"text":"Krispy Kreme Earnings Slide; Change in Strategy Is Planned Krispy Kreme, which wowed Wall Street with a hot old-economy growth story when it went public, has lost more than two-thirds of its value since it peaked a year ago.","label":2}
{"text":"From Behind the Scenes, Rice on Stage Administration officials said President Bush might name Condoleezza Rice as secretary of state as early as Tuesday.","label":0}
{"text":"Verizon to buy Nextwave licenses for \\$3 billion Verizon Wireless (VZ.N: Quote, Profile, Research) said on Thursday that it had signed an agreement with NextWave Telecom Inc. (NXLC.","label":2}
{"text":"Iran and Europe Negotiate to Try to Save Nuclear Agreement Iran and its European partners struggled to salvage their agreement committing Tehran to freeze an important part of its nuclear program.","label":0}
{"text":"IDC Raises '04 PC Outlook, Trims Forecast (Reuters) Reuters - Market research firm IDC has raised\\its 2004 forecast for global personal computer sales growth to\\14.2 percent from 13.5 percent, driven by high commercial\\demand, it said on Monday.","label":3}
{"text":"AMD starts shipping 90-nanometer chips to customers Advanced Micro Devices Inc.'s (AMD Inc.'s) 90-nanometer notebook processors are on their way to customers, according to a research note published by Goldman Sachs   Co. Thursday.&lt;p&gt;ADVERTISEMENT&lt;\/p&gt;&lt;p&gt;&lt;img src=\"http:\/\/ad.doubleclick.net\/ad\/idg.us.ifw.general\/ibmpseries;sz=1x1;ord=200301151450?\" width=\"1\" height=\"1\" border=\"0\"\/&gt;&lt;a href=\"http:\/\/ad.doubleclick.net\/clk;9824455;9690404;u?http:\/\/ad.doubleclick.net\/clk;9473681;9688522;d?http:\/\/www.ibm.com\/servers\/eserver\/pseries\/campaigns\/boardroom\/index.html?ca=pSeries met=boardroom me=E P_Creative=P_InfoW_RSS\"&gt;Introducing IBM eServer p5 systems.&lt;\/a&gt;&lt;br\/&gt;Powered by IBMs most advanced 64-bit microprocessor (POWER5(tm)), p5 systems can run UNIX and Linux simultaneously. Learn more about eServer p5 systems.&lt;\/p&gt;","label":3}
{"text":"Does Kimberly-Clark Have Inner Beauty? Surface numbers disappoint, but that's as far as Wall Street looks.","label":2}
{"text":"Stoudemire Scores 33 As Suns Top Clippers LOS ANGELES - Amare Stoudemire overcame early foul trouble to score 33 points and the Phoenix Suns beat the Los Angeles Clippers 122-111 for their fourth straight victory on Sunday.","label":1}
{"text":"Arch Coal completes Triton deal SAN FRANCISCO (CBS.MW) - Arch Coal said it completed its \\$364 million acquisition of Triton Coal Friday, hours after a Federal Court turned down efforts by the Federal Trade Commission to block the deal. ","label":2}
{"text":"December 13 Titan Flyby Prelude to Landing The countdown is underway for the next flyby of the Saturian moon Titan for Monday, December 13, 2004 by the Cassini spacecraft expected to yield more detailed imaging ","label":3}
{"text":"Israel to Pull Forces from Gaza Refugee Camp -Reports  JERUSALEM (Reuters) - Israeli Prime Minister Ariel Sharon  decided on Thursday that Israeli forces could withdraw from a  teeming refugee camp in northern Gaza, media reports said.","label":0}
{"text":"US and EU put air dispute on hold Washington and Brussels say they will not escalate a dispute over subsidies to Boeing and Airbus.","label":2}
{"text":"U.S. and Iraqi Forces Attack Insurgents SAMARRA, Iraq - U.S. and Iraqi forces launched a major assault Friday to regain control of the insurgent stronghold of Samarra, and hospital officials said at least 21 people were killed and 35 wounded...","label":0}
{"text":"Nikkei Dips Techs, Steel Makers Fall (Reuters) Reuters - Tokyo's Nikkei average fell 0.14 percent\\by midday on Thursday with losses in shipping firms, steel\\makers and several technology shares overshadowing gains in\\selective small-cap stocks and firms with bright earnings\\outlooks.","label":2}
{"text":"Oracle names proposed PeopleSoft board Oracle has named four candidates that it plans to nominate to the board of PeopleSoft, as it pushes forward with its efforts to try to take control of the rival company.","label":2}
{"text":"Fear Is Spread by Body Language, Study Says The study shows that images of fear affect the emotional part of the brain. Since the link between the emotional brain and action is stronger than the link between the visual brain and action, viewing fearful ","label":3}
{"text":"Holes yet to be covered The Patriots worked out former Super Bowl MVP Dexter Jackson Monday, according to the NFL's daily personnel notice, but by last night the safety had agreed to terms with his former team, the Tampa Bay Buccaneers.","label":1}
{"text":"Dolphins Want a Refund From Williams The Miami Dolphins have asked Ricky Williams to return \\$8.6 million they say the running back owes the team because he has decided to retire.","label":1}
{"text":"Carbon dioxide spike renews global warming fears The amount of carbon dioxide in the Earth #39;s atmosphere has increased faster than expected in the last two years, renewing concern that global warming may accelerate.","label":0}
{"text":"Serena Blames Headache for Linz Upset (AP) AP - Serena Williams blamed a headache for her poor play in a 7-6 (5), 6-3 upset loss to qualifier Alina Jidkova in the second round of the Generali Ladies Open.","label":1}
{"text":"Hollywood Embraces HD DVD HD DVD is gaining momentum with Hollywood studios. Several studios have announced their intentions to go with the Toshiba format, among them New Line Cinema, Paramount ","label":3}
{"text":"For Jordan, Future Is Looking Bright Eddie Jordan checked out of the hospital yesterday. He ended up there after Washington Wizards trainers examined his swollen left calf on Thanksgiving morning and immediately recommended that the team #39;s head coach see a physician.","label":1}
{"text":"RIM takes new BlackBerry design overseas Research In Motion is targeting European and Asian markets with a phone-and-messaging device that uses the company #39;s new SureType keyboard design.","label":3}
{"text":"Powell meets Israel #39;s Sharon US Secretary of State Colin Powell has met Prime Minister Ariel Sharon for talks expected to focus on steps Israel could take to facilitate a Palestinian presidential election scheduled for January.","label":0}
{"text":"The Hague Fouls up the Atmosphere Maybe the most unpleasant Ankara-Brussels meeting since the Justice and Development Party (AKP) came to power in 2002 was held in The Hague last week.","label":0}
{"text":"Think Again? Maybe with its relative distance from Microsoft, Lenovo will feel free to do what domestic PC makers don #39;t: aggressively make and market Linux desktops and laptops.","label":3}
{"text":"US Online Retail Sales Expected To Double In Six Years Online retail sales in the US are expected to double by 2010, accounting for 12 percent of the total retail sales, a market research firm said Monday.","label":3}
{"text":"Halliburton Posts \\$44 Million Loss  HOUSTON (Reuters) - Halliburton Co. &lt;A HREF=\"http:\/\/www.investor.reuters.com\/FullQuote.aspx?ticker=HAL.N target=\/stocks\/quickinfo\/fullquote\"&gt;HAL.N&lt;\/A&gt; , the world's  No. 2 oil field services company, on Tuesday posted a  third-quarter net loss as charges from its asbestos liability  weighed.","label":2}
{"text":"Lithuania Reaches Semifinals With a different star but the same team concept, Lithuania reached the men's basketball semifinals for the fourth straight Olympics.","label":1}
{"text":"Sweden Opens Hockey World Cup with Win Over Germany Toronto Maple Leafs captain Mats Sundin shone in Sweden #39;s opening 5-2 win over Germany at the World Cup of Hockey Tuesday, scoring once and providing two assists in a match with contrasting team tactics.","label":1}
{"text":"US, North Korean officials meet at UN US officials met twice last week with North Korean officials in New York to tell them the US was ready to resume nuclear negotiations and wanted to resolve the issue diplomatically, State Department spokesman Adam Ereli said.","label":0}
{"text":"Spain vs US in Seville for Davis Cup title Spain will take on the United States for the Davis Cup champion in Southern Spain #39;s Seville City on December 3-5, China Radio International reported Wednesday.","label":1}
{"text":"Q  amp; A Julius Williams No matter the time, place, or situation, East Boston's Julius Williams never seems to run out of gas. The No. 2 scorer in Division 3A (18 touchdowns, seven 2-point conversions), Williams is coming off a 230-yard, four-touchdown performance against Boston English. Williams, a senior, explains why he is the city's best running back in this week's Q  amp; A.","label":1}
{"text":"Computing pioneers get historical nod Spreadsheet pioneer Dan Bricklin is among the computing innovators honored by the Computer History Museum.","label":3}
{"text":"Opening The Desktop The Mozilla Foundation #39;s new Thunderbird E-mail client, released last week, is positioned as a simple-but-secure alternative to Microsoft #39;s widely used Outlook Express.","label":3}
{"text":"Two shot dead in Yala as Ramadan ends Militants shot dead a former policeman and a Burmese migrant worker in the southernmost province of Yala Sunday just as Muslims marked the end of Ramadan.","label":0}
{"text":"Borland #39;s Pitch:  #39;Software Delivery Optimization #39; As more software development companies find ways to simplify the application development process, Borland Software (Quote, Chart) is unveiling a new software delivery optimization (SDO) model built around that concept.","label":3}
{"text":"AOL Shuns Mac Users With New PassCode Service A new, optional log-on service from America Online that makes it harder for scammers to access a persons online account will not be available for Macintosh ","label":3}
{"text":"Hudson Traded to Braves  ATLANTA (Sports Network) - The Atlanta Braves have acquired  standout righthander Tim Hudson from the Oakland Athletics in  exchange for outfielder Charles Thomas, right-handed pitcher  Juan Cruz and left-handed pitcher Dan Meyer.","label":1}
{"text":"Texans Safety Marcus Coleman Out for Year (AP) AP - Texans safety Marcus Coleman will miss the rest of the season with a right shoulder injury,","label":1}
{"text":"Cox Enterprises to Buy Cox Public Stake Cox Enterprises Inc. on Tuesday said it will purchase Cox Communications Inc. #39;s (COX.N: Quote, Profile, Research) minority public stake for \\$8.","label":2}
{"text":"BSNL, MTNL to launch high-speed Internet (Reuters) Reuters - India's two state-run telephone companies will start high-speed Internet services from Jan. 15 at about a sixth of the prevailing prices, a government statement said on Friday.","label":0}
{"text":"Exploit code for JPEG flaw released Security experts warned on Wednesday that  quot;exploit code quot; has been released for the critical flaw discovered in the way Windows and other Microsoft products handle JPEG images (see our previous coverage).","label":3}
{"text":"Rongen Named Coach of MLS Expansion Team (AP) AP - Thomas Rongen, who guided D.C. United to the 1999 Major League Soccer championship, was hired Thursday as coach of Club Deportivo Chivas USA, an expansion team set to begin play in April.","label":1}
{"text":"Another Hurricane Roars Across Mid-Florida Hurricane Jeanne caused at least five deaths, making landfall almost exactly where Frances did over Labor Day weekend.","label":0}
{"text":"Sprint Nears Acquisition of Nextel Description: Sprint is about to acquire Nextel in a telecom merger that would create the nation #39;s third-largest wireless company.","label":2}
{"text":"Israeli soldiers  quot;killed in Gaza blast quot; Jazeera said eight soldiers were wounded on Sunday and a ninth was missing in addition to the four dead. Israeli sources said there were.","label":0}
{"text":"Setback cools off Heat #39;s spicy start And then are the nights like this, when life with Shaquille O #39;Neal and Dwyane Wade isn #39;t such a carefree joy ride. Caught in the fast lane that is the Dallas Mavericks #39; offense, the Heat crashed and burned ","label":1}
{"text":"A Time Line Of The IBM PC Business Dec. 8, 2004 From the introduction of its first PC in 1981 to this week #39;s sale of its PC business to Lenovo of China for about \\$1.75 billion in cash, IBM has had a quite a few milestones in the PC industry.","label":3}
{"text":"Lexmark Loss Good for Consumers The printer maker's courtroom setback may mean consumer electronics companies won't try to use the Digital Millennium Copyright Act as an all-purpose competition shield anymore. By Katie Dean.","label":3}
{"text":"One vacancy could reshape court (USATODAY.com) USATODAY.com - Monday's announcement that Chief Justice William Rehnquist is being treated for thyroid cancer was a reminder of one man's mortality - and of how a single vacancy on the U.S. Supreme Court could change the dynamics of the divided panel.","label":0}
{"text":"SEC Bars Mutual Fund Payoffs to Brokers  WASHINGTON (Reuters) - The U.S. Securities and Exchange  Commission pushed ahead on Wednesday with reforms of the  \\$7.5-trillion mutual fund industry amid scandals that have  shaken fund investors' confidence.","label":2}
{"text":"Apple cuts prices and improves products Apple introduced a range of new machines on Tuesday, as it gears up for the annual christmas shopping season. As part of the launch, it cut the price of its entry-level iBook G4 notebook computer and boosted chip speed across the line.","label":3}
{"text":"BAA Reports Strong Net Profit in 1st Half BAA, the world #39;s largest airport operator, said Tuesday it is on target for strong annual passenger growth after reporting a 17.","label":2}
{"text":"As U.S. Advances in Falluja, New Fighting Erupts in Northern Iraq Insurgents opened a new front against U.S.-led forces today in Mosul, while an enormous car bomb in Baghdad killed at least 13 people.","label":0}
{"text":"Chargers Opening Eyes With 4-3 Start (AP) AP - Surprise, surprise. Look who's above .500 and talking about making a playoff push. None other than the San Diego Chargers.","label":1}
{"text":"More U.S. Soldiers Survive War Wounds (AP) AP - For every American soldier killed in Iraq, nine others have been wounded and survived  #151; the highest rate of any war in U.S. history. It isn't that their injuries were less serious, a new report says. In fact, some young soldiers and Marines have had faces, arms and legs blown off and are now returning home badly maimed.","label":0}
{"text":"Funk Takes One Shot Lead at Buick Championship  CROMWELL, Connecticut (Reuters) - Fred Funk shot a  one-under-par 69 Saturday to take a one-shot lead after the  third round of the Buick Championship.","label":1}
